# 1. First steps with Pandas
---
First thing we have to do in any data analytics project is import the libraries that will be used. To import the Pandas library we only have to do the following:

In [1]:
import pandas as pd

### 1.1. Creating Data
---
A **DataFrame** object is a table that contains an array of individual entries, each of which has a certain value. Each entry corresponds with a row and a column.

When creating a new `DataFrame` you have to specify the data to represent(integers, strings...). Then we can also specify an **Index** parameter (row labels) to asign values in the constructor. 

If `index` is not specified, the row labels will take values ascending from 0.

In [2]:
pd.DataFrame({'Apples': ['11', '22'],
              'Bananas': ['33', '44'],
              'Kiwis': ['55', '66']},
            index=['2017 Sales', '2018 Sales'])

           Apples Bananas Kiwis
2017 Sales     11      33    55
2018 Sales     22      44    66

A **Series** object is a sequence or a list of data values. Its the same as a single column of a `DataFrame`. We can assign the column values to the `Series` the same way as before, using an `index` parameter. `Series` do not have a column name, it only has an overall name.

In [3]:
pd.Series([123, 456, 789],
         index=['2016 Sales','2017 Sales','2018 Sales'],
         name='Kiwis')

2016 Sales    123
2017 Sales    456
2018 Sales    789
Name: Kiwis, dtype: int64

### 1.2. Reading common file formats
---
When we are working with data that already exists, we should know the file format. If the file format is a CSV we will use the `read_csv` function to read the data and copy it in a `DataFrame`.

In [4]:
battles_got = pd.read_csv('datasets/battles.csv')

We can also use `shape` attribute to check how large the resulting `DataFrame is`:

In [5]:
battles_got.shape

(38, 25)

To examine the contents of the resultant `DataFrame` we can use the `head` command, which shows the first five rows.

In [6]:
battles_got.head()

,name,year,battle_number,attacker_king,defender_king,attacker_1,attacker_2,attacker_3,attacker_4,defender_1,...,major_death,major_capture,attacker_size,defender_size,attacker_commander,defender_commander,summer,location,region,note
0,Battle of the Golden Tooth,298,1,Joffrey/Tommen Baratheon,Robb Stark,Lannister,NaN,NaN,NaN,Tully,...,1.0,0.0,15000.0,4000.0,Jaime Lannister,"Clement Piper, Vance",1.0,Golden Tooth,The Westerlands,NaN
1,Battle at the Mummer's Ford,298,2,Joffrey/Tommen Baratheon,Robb Stark,Lannister,NaN,NaN,NaN,Baratheon,...,1.0,0.0,NaN,120.0,Gregor Clegane,Beric Dondarrion,1.0,Mummer's Ford,The Riverlands,NaN
2,Battle of Riverrun,298,3,Joffrey/Tommen Baratheon,Robb Stark,Lannister,NaN,NaN,NaN,Tully,...,0.0,1.0,15000.0,10000.0,"Jaime Lannister, Andros Brax","Edmure Tully, Tytos Blackwood",1.0,Riverrun,The Riverlands,NaN
3,Battle of the Green Fork,298,4,Robb Stark,Joffrey/Tommen Baratheon,Stark,NaN,NaN,NaN,Lannister,...,1.0,1.0,18000.0,20000.0,"Roose Bolton, Wylis Manderly, Medger Cerwyn, H...","Tywin Lannister, Gregor Clegane, Kevan Lannist...",1.0,Green Fork,The Riverlands,NaN
4,Battle of the Whispering Wood,298,5,Robb Stark,Joffrey/Tommen Baratheon,Stark,Tully,NaN,NaN,Lannister,...,1.0,1.0,1875.0,6000.0,"Robb Stark, Brynden Tully",Jaime Lannister,1.0,Whispering Wood,The Riverlands,NaN

The `read_csv` function has over 30 optional parameters you can specify. We can use the `pandas` [API Reference](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html) to know how to use all these parameters.

If the file format is an Excel file (`XLS` or `XLST`) it organizes itself as a sequence of named sheets (or table). To load the data into `pandas` we need to specify the name of the sheet of interest as additional `sheet_name` parameter.

In [7]:
property_prices_madrid = pd.read_excel('datasets/historico-precios-venta-esp-q4.xlsx',
                                      sheet_name='madrid distritos')
property_prices_madrid.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 60,Unnamed: 61,Unnamed: 62,Unnamed: 63,Unnamed: 64,Unnamed: 65,Unnamed: 66,Unnamed: 67,Unnamed: 68,Unnamed: 69
0,madrid (euros/m2),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,distrito,4q 2000,1q 2001,2q 2001,3q 2001,4q 2001,1q 2002,2q 2002,3q 2002,4q 2002,...,3q 2015,4q 2015,1q 2016,2q 2016,3q 2016,4q 2016,1q 2017,2q 2017,3q 2017,4q 2017
3,Arganzuela,n.d.,1920.41,1989.76,1974.72,2027.38,2150.81,n.d.,n.d.,n.d.,...,2787.15,2746,2834.9,2917.82,2925.24,3012.7,3136.8,3204.21,3293.41,3528.86
4,Barajas,n.d.,1661.89,1679.78,1842.43,1964.72,2082.55,2151.75,2542.64,2593.13,...,2602.93,2602,2585.36,2571.43,2604.42,2671.57,2642.25,2700.25,2866.75,2993.2

If we want to connect to a SQL database, we first need to create a connector. Each type of SQL database has his own connector. In this example, we connect to `MSSQL`, but we first need to import the `create_engine` module from `sqlalchemy` python library.

You have to make sure that driver ODBC is installed for your SQL Server version. In this example, we are using SQL Server 17. To download this driver you can enter the next link ([Driver for SQL Server 17](https://docs.microsoft.com/en-us/sql/connect/odbc/download-odbc-driver-for-sql-server?view=sql-server-2017)).

If you use a different SQL data base, you can read the official documentation of pyodbc ([connection chains](https://github.com/mkleehammer/pyodbc/wiki)).

In the next example we use the `urllib` package to create the conection to the database.

In [ ]:
import urllib
params = urllib.parse.quote_plus("DRIVER={ODBC Driver 17 for SQL Server};PORT=1433;SERVER=PCUSERNAME\SQLEXPRESS;DATABASE=prueba;UID=sa;PWD=*****)

We use [sqlalchemy](https://docs.sqlalchemy.org/en/latest/) to facilitate the management of the database.
**create_engine** allows us to create an adapter to communicate with SQL Server. Other adapters can be created for other databases ([Other examples](https://docs.sqlalchemy.org/en/latest/core/engines.html)).

In [9]:
from sqlalchemy import create_engine 
engine = create_engine("mssql+pyodbc:///?odbc_connect=%s" % params)

In [10]:
sql_df = pd.read_sql_table('test_table', engine)
sql_df.head()

  TEST Number TEST Text
0           1     text1
1           2     text2
2           3     text3
3           4     text4
4           5     text5

Then we can write an SQL statement to get some data out of the SQL database and into `pandas`.

In [11]:
testing = pd.read_sql_query("SELECT * FROM test_table", engine)
testing.head()

  TEST Number TEST Text
0           1     text1
1           2     text2
2           3     text3
3           4     text4
4           5     text5

### 1.3. Writing common file formats
---
If you want to write a CSV data we have to use the `to_csv` function. If we want to write an Excel file you need to use `to_excel` function and introduce the `sheet_name` parameter. If we want to output to a SQL database, we have to supply the name of the table in the database we want to throw the data into, and a connector.

In [12]:
battles_got.head().to_csv('battlesNEW.csv')

property_prices_madrid.to_excel('historico-precios-venta-madridNEW.xlsx',
                                      sheet_name='madrid distritos')

sql_df.head().to_sql("test_table_head", engine)